[M_TempleTower MissionDefinition]
MissionName="A child's miracle"
MissionDescription="The magical assassin asks you to wait a few hours for his son, the younger assassin.."
TurnInDescription="As a tool like shaking."
MissionSummary="Protect your murderous son."
MissionGiver="witch slayer"
MissionTurnInLocation="slayer of witches"
TeaserText="Financial officer, spy camera, and babysitter.<br><br>Bring your friends."

[M_TempleTower:DefendTheTower MissionObjectiveDefinition]
ProgressMessage="Defend the castle"

[M_TempleTower:DefendTheTowerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TempleTower:RaiseTower MissionObjectiveDefinition]
ProgressMessage="Talk to the child"

[M_TempleTower:RaiseTowerSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="The magical killer asks you to take care of his offspring for a few hours, which is slightly dead..<br>But when you face the murderer's son, you discover that a group of thugs wants to kill him. The magical killer asks you to save his son at all costs. If the bad guys can kill the little killer. Destroy his tower and it's over.."

[M_TempleTower:TempleTower_Gather MissionObjectiveDefinition]
ProgressMessage="The murderer's son is coming"

[M_TempleTower:TempleTowerGatherSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_TempleTower:WavesComplete MissionObjectiveDefinition]
ProgressMessage="reduce power"

